[
    {
        "id": 2380570,
        "title": "BBQ Sticky Ribs",
        "story": "Pork ribs marinated overnight in a sweet barbecue sauce slowly cooked and finished off on a BBQ",
        "image_url": "https://img-global.cpcdn.com/recipes/65555efe64df98ce/m/photo.jpg",
        "published_at": "2017-07-05T02:34:00+00:00",
        "user": {
            "name": "Liam Nichols",
            "image_url": "https://img-global.cpcdn.com/users/f34ef79fabdb58a4/m/photo.jpg"
        },
        "ingredients": [
            "2 kg pork ribs",
            "400 g chopped tomatoes",
            "5 garlic cloves",
            "100 g soft brown sugar",
            "75 ml maple syrup",
            "150 ml ketchup",
            "150 ml BBQ sauce",
            "150 ml Honey Jack Daniels whiskey",
            "50 ml cider vinegar",
            "2 tbsp black treacle",
            "3 tbsp soy sauce",
            "2 tbsp Worcestershire sauce"
        ],
        "steps": [
            {
                "description": "Crush the garlic cloves and add all ingredients apart from the ribs into a pan",
                "image_urls": [
                    "https://img-global.cpcdn.com/steps/0606534c251df2e5/m/photo.jpg"
                ]
            }
        ]
    },
    {
        "id": 3106180,
        "title": "Mini olive pies by Vaggelio",
        "story": "This is the most delicious savory snack that I have ever tasted!!!\n\nRecipe by louna",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/74e4ac3795576505efa5662f29c4b84a.jpg",
        "published_at": "2021-12-22T19:55:14+00:00",
        "user": {
            "name": "David",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/ed47ccc0490dc7e5.jpg"
        },
        "ingredients": [
            "1 cup oil",
            "1 cup orange juice",
            "flour, as much as it takes (about 1/2 kg)",
            "1/2 kg pitted olives",
            "2-3 small spring onions finely chopped",
            "finely chopped spearmint (preferably fresh)"
        ],
        "steps": [
            {
                "description": "Blend the olives in a food processor. Mix them with the onion and the spearmint.",
                "image_urls": []
            },
            {
                "description": "Prepare the dough by placing the liquids in a bowl and adding flour until you have a soft dough that doesn't stick. Set it aside to rest for 15 mninutes.",
                "image_urls": []
            },
            {
                "description": "Roll out the dough in filo sheets that are almost square, then divide the filo sheet into 4 quarters and each quarter into 2 triangles. Starting from the base of the triangly, place a spoonful of filling, then fold the ends inwards and roll towards the top point, like a small croissant.",
                "image_urls": []
            },
            {
                "description": "Place them in a baking tray lined with greaseproof paper and bake at 180°C until golden brown. ",
                "image_urls": []
            }
        ]
    },
    {
        "id": 188350,
        "title": "Seafood Ehomaki (Lucky Fat Sushi Rolls)",
        "story": "Since year after year, my family won't eat store-bought ehomaki, so I make them at home with seafood filling. By serving home-made ehomaki, I can save money, too.\r\n\r\nWith about 720 to 900 ml of uncooked rice I was able to make 5 sushi rolls with a little bit of leftover sushi rice. Wrapping them with a sushi mat is, of course, OK! My kids and husband don't really like futomaki with dried gourd shavings or denbu (dried fish flakes), so I made ones that they would like. For those using store-bought sushi vinegar, please use 135 ml. For 5 servings. Recipe by Kyoku.",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5059448610488320.jpg",
        "published_at": "2021-12-22T04:53:00+00:00",
        "user": {
            "name": "Nova",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 Cooked white rice 4 to 5 rice cooker cups (1320 to 1650 grams cooked, using 720 ml to 900 ml uncooked raw rice)",
            "10 cm Kombu",
            "2 tbsp Sake",
            "3 to 5 tablespoons ○ Sugar",
            "1 tsp ○ Salt",
            "1 dash over 100 ml ○ Vinegar",
            "5 to 7 sheets, nori seaweed",
            "200 grams Sashimi grade tuna",
            "120 grams Salmon (smoked or sashimi grade)",
            "150 grams Squid (sashimi grade)",
            "5/8 Cucumber",
            "50 grams Shredded egg crepes (or Japanese atsuyaki thick omlette or dashimaki rolled omlette)"
        ],
        "steps": [
            {
                "description": "I use a handy fat sushi roll mold that I bought at a 100 yen shop, but you can also use a sushi mat.  After rinsing the rice, I strain it and let it sit for 30 minutes. Then, I make small cuts on both sides of the konbu, add it to the rice together with sake, and then cook the rice. Next, I mix in the seasoned rice vinegar and cool off the rice with a hand-held fan. Finally, I put a damp cloth over the rice.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4686671856533504.jpg"
                ]
            },
            {
                "description": "The next step is to gather the filling ingredients. Shredded egg crepes, cucumbers, squid, salmon (either cheap smoked salmon or sashimi), and fresh, sashimi grade tuna. This will complete your color palatte of yellow, green, white, orange and red. Aside from the shredded egg crepe, all the ingredients should be cut lengthwise. For adults, use squid or salmon, together with a touch of wasabi.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5954519585259520.jpg"
                ]
            },
            {
                "description": "Wet the inner surface of the mold each time with water. Fill the mold with sushi rice, lay a 1/2 sheet of sushi nori in the center, arrange the fillers inside the nori, taking care to balance the colors, and seal the nori around fillers. Fill the rest of the mold with sushi rice and press the cover on.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5984909968539648.jpg"
                ]
            },
            {
                "description": "Drop the contents onto a sheet of sushi nori and roll to create an instant futomaki fat sushi roll! Even after making 5 rolls, a small bowl of sushi rice is left over. You can use that to make a mini Tekkadon (sushi rice topped with thin-sliced raw tuna sashimi) or Nattodon (sushi rice topped with fermented soy beans).",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5209213180575744.jpg"
                ]
            },
            {
                "description": "Cut them to serve. If you want to use less rice, just add more ingredients, if you please.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6237037836369920.jpg"
                ]
            },
            {
                "description": "Since my eldest son loves any kind of sashimi tuna, I fill these with plenty of tuna.",
                "image_urls": []
            }
        ]
    },
    {
        "id": 154638,
        "title": "Sukiyaki (with Kansai-style Warishita Sauce)",
        "story": "In the Kansai region, we usually don't use warishita sauce, but we add sugar, soy sauce, sake and other seasonings one at a time. It's bothersome so I combined the ingredients together. Not adding water or dashi stock is the Kansai way, I think. I had good feedback on this dish, so I posted the recipe.\r\n\r\nAdd the warishita little by little as you add the ingredients. If you have leftover warishita, use as seasoning for teriyaki dishes or sesame sauce. Recipe by Gima-ru",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5873714515148800.jpg",
        "published_at": "2021-12-22T02:05:00+00:00",
        "user": {
            "name": "Brenton",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "500 grams Thinly sliced beef for sukiyaki",
            "1/4 Chinese cabbage, small",
            "1/2 Onion",
            "1 bunch Chrysanthemum greens",
            "1 pack Shiitake mushrooms",
            "1 pack Enoki mushrooms",
            "1 Japanese leek",
            "1/2 to 1 block Grilled tofu",
            "1 pack Shirataki noodles (konnyaku noodles)",
            "1 Fresh eggs",
            "6 tbsp ●Soy sauce",
            "4 tbsp or more ●Sugar",
            "5 tbsp ●Sake"
        ],
        "steps": [
            {
                "description": "How to make warishita: In a pot or in the microwave, heat the ● seasonings. If microwaving, microwave for 2 minutes at  500W. Stir well to dissolve the sugar.",
                "image_urls": []
            },
            {
                "description": "Cut or slice the ingredients to preferable bite sizes.",
                "image_urls": []
            },
            {
                "description": "Heat a sukiyaki iron pot and melt the beef fat. After the pan is hot, quickly fry several slices of beef. Add the warishita sauce and let it absorb into the beef. (At this point, take a bite! This first bite is particularly great and you can enjoy the great taste of beef.)",
                "image_urls": []
            },
            {
                "description": "Add vegetables and other ingredients, pour the warishita sauce, and bring to a simmer. Dip in a beaten egg and enjoy!",
                "image_urls": []
            }
        ]
    },
    {
        "id": 152186,
        "title": "Nostalgic...Ketchup Flavored Udon Noodles",
        "story": "My grandma used to make this for me when I was small. It's stir fried udon noodles (yaki-udon) but for some reason she added a lot of ketchup. I like lots of ketchup in this too!\r\n\r\nBy putting a lid on and steam-cooking  over low heat, you can draw out the sweetness of the vegetables. \r\nThe flavor differs depending on the amount of udon noodles used and the moisture in the vegetables, so please adjust the amount of ketchup and sauce accordingly. \r\nUse more ketchup than Worcestershire-type sauce. Recipe by Kinakorin",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5451502050082816.jpg",
        "published_at": "2021-12-22T01:37:00+00:00",
        "user": {
            "name": "Shelton",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 pack Udon noodles",
            "50 to 100 grams Pork, cut into thin strips",
            "1/8 Cabbage",
            "1 Green bell pepper",
            "5 cm Japanese leek",
            "1 tsp Soy sauce (to pre-season)",
            "1 tbsp Sesame oil",
            "2 1/2 tbsp Ketchup",
            "1 1/2 tbsp Japanese Worcestershire-style sauce",
            "1 Aonori"
        ],
        "steps": [
            {
                "description": "Massage the soy sauce into the pork to pre-season it. Chop up the cabbage, and slice the carrot into short rectangular pieces. Slice the leek and bell pepper thinly.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5981434266255360.jpg"
                ]
            },
            {
                "description": "Heat some sesame oil in a frying pan and stir fry the pork over medium heat. When the color of the meat changes, add the leek, bell pepper and carrot and stir once, then add the cabbage on top (don't mix it in). Put a lid on and steam cook over low heat.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5018481098489856.jpg"
                ]
            },
            {
                "description": "After about 5 minutes the cabbage will have wilted and moisture will be coming out of it. Turn the heat up to medium and add the udon noodles. Mix well, add the ketchup and sauce, and it's done Serve with aonori and bonito flakes on top if you like.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5057445847105536.jpg"
                ]
            }
        ]
    }
]
